CSI API ETABS v1
cAnalysisResults.ModalPeriod Method
 Reports the modal period, cyclic frequency, circular frequency and eigenvalue for each selected modal load case
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int ModalPeriod(
	ref int NumberResults,
	ref string[] LoadCase,
	ref string[] StepType,
	ref double[] StepNum,
	ref double[] Period,
	ref double[] Frequency,
	ref double[] CircFreq,
	ref double[] EigenValue
)
Function ModalPeriod (
	ByRef NumberResults As Integer,
	ByRef LoadCase As String(),
	ByRef StepType As String(),
	ByRef StepNum As Double(),
	ByRef Period As Double(),
	ByRef Frequency As Double(),
	ByRef CircFreq As Double(),
	ByRef EigenValue As Double()
) As Integer
Dim instance As cAnalysisResults
Dim NumberResults As Integer
Dim LoadCase As String()
Dim StepType As String()
Dim StepNum As Double()
Dim Period As Double()
Dim Frequency As Double()
Dim CircFreq As Double()
Dim EigenValue As Double()
Dim returnValue As Integer
returnValue = instance.ModalPeriod(NumberResults,
	LoadCase, StepType, StepNum, Period,
	Frequency, CircFreq, EigenValue)
int ModalPeriod(
	int% NumberResults,
	array<String^>^% LoadCase,
	array<String^>^% StepType,
	array<double>^% StepNum,
	array<double>^% Period,
	array<double>^% Frequency,
	array<double>^% CircFreq,
	array<double>^% EigenValue
)
abstract ModalPeriod :
        NumberResults : int byref *
        LoadCase : string[] byref *
        StepType : string[] byref *
        StepNum : float[] byref *
        Period : float[] byref *
        Frequency : float[] byref *
        CircFreq : float[] byref *
        EigenValue : float[] byref -> int
Parameters
NumberResults
Type: System.Int32
 The total number of results returned by the program
LoadCase
Type: System.String[]
 This is an array that includes the name of the modal load case associated with each result
StepType
Type: System.String[]
 This is an array that includes the step type, if any, for each result. For modal results, this will always be Mode
StepNum
Type: System.Double[]
 This is an array that includes the step number for each result. For modal results, this is always the mode number
Period
Type: System.Double[]
 This is an array that includes the period for each result. [s]
Frequency
Type: System.Double[]
 This is an array that includes the cyclic frequency for each result. [1/s]
CircFreq
Type: System.Double[]
 This is an array that includes the circular frequency for each result. [rad/s]
EigenValue
Type: System.Double[]
 This is an array that includes the eigenvalue for the specified mode for each result. [rad2/s2]
Return Value
Type: Int32
 Returns zero if the data is successfully recovered; otherwise it returns a nonzero value
Remarks
 See Results for more information.
Examples
Public Sub Example()
   'dimension variables
   Dim SapObject as cOAPI
   Dim SapModel As cSapModel
   Dim ret As Integer = -1
   Dim NumberResults As Integer
   Dim LoadCase() As String
   Dim StepType() As String
   Dim StepNum() As Double
   Dim Period() As Double
   Dim Frequency() As Double
   Dim CircFreq() As Double
   Dim EigenValue() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis()
   'deselect all cases and combos
       ret = SapModel.Results.Setup.DeselectAllCasesAndCombosForOutput()
   'set case selected for output
       ret = SapModel.Results.Setup.SetCaseSelectedForOutput("MODAL")
   'get modal period
       ret = SapModel.Results.ModalPeriod(NumberResults, LoadCase, StepType, StepNum, Period, Frequency, CircFreq, EigenValue)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalysisResults Interface
ETABSv1 Namespace